tests/artillery.yml
config:
  target: https://tofuchic.github.io/kancolle
  phases:
    - name: "test"
      arrivalCount: 1
      duration: 1
  payload:
    - path: ./env.csv
      fields:
        - "username"
        - "password"
  # Enable the Playwright engine:
  engines:
    playwright:
      # Only for local debug, set false
      launchOptions:
        headless: true
  processor: "./playwright.js"
scenarios:
  - engine: playwright
    flowFunction: "helloKancolle"
    flow: []